In [1]:
a = 7 
a

7

In [2]:
import pandas as pd
import numpy as np 
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago'],
    'Salary': [70000, 80000, 90000]
}
df = pd.DataFrame(data)
df

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000

In [ ]:
# Operations and Functions
df['Sales'].mean()
# df['Sales'].agg({'sum': 'sum', 'mean': 'mean', 'max': 'max', 'min': 'min'}) 
df.shape  
df.columns
df.describe()
df[[]]

# all operations and functions on dataframe

In [ ]:
# Dataframe applying functions
df.apply(lambda x: x['Sales'] * 1.1 if x['Region'] == 'North' else x['Sales'] * 1.2, axis=1)
df.applymap(lambda x: x * 2 if isinstance(x, (int, float)) else x)  # Apply function to all elements in DataFrame